Tekla Open API Reference for Tekla Structures 2025
Solid.Intersect Method (Point, Point, Point)
Note: This API is now obsolete.
 Returns a list of plane - solid intersection points. The first item of the list contains a list of the outmost intersection polygon and the rest of the items (if there are any) inner polygons.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Intersect is deprecated, please use IntersectAllFaces instead.")]
public ArrayList Intersect(
	Point point1,
	Point point2,
	Point point3
)
<ObsoleteAttribute("Intersect is deprecated, please use IntersectAllFaces instead.")>
Public Function Intersect (
	point1 As Point,
	point2 As Point,
	point3 As Point
) As ArrayList
Parameters
point1
Type: Tekla.Structures.Geometry3d.Point
The first plane point.
point2
Type: Tekla.Structures.Geometry3d.Point
The second plane point.
point3
Type: Tekla.Structures.Geometry3d.Point
The third plane point.
Return Value
Type: ArrayList
An array list of intersection point lists.
See Also
Reference
Solid Class
Intersect Overload
Tekla.Structures.Model Namespace